spec/cassettes/payment_method_details/when_set_on_the_same_payment_method.yml

---
http_interactions:
- request:
    method: post
    uri: https://ics2wstesta.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.121">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>17-1493326081</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.65.0</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin16</clientEnvironment>
        <billTo>
          <firstName>Tobias</firstName>
          <lastName>Luetke</lastName>
          <street1>123 Some St</street1>
          <city>Eugene</city>
          <state>OR</state>
          <postalCode>97408</postalCode>
          <country>US</country>
          <email>user32@hellobar.com</email>
        </billTo>
        <purchaseTotals>
          <currency>USD</currency>
          <grandTotalAmount>0.00</grandTotalAmount>
        </purchaseTotals>
        <card>
          <accountNumber>4111111111111111</accountNumber>
          <expirationMonth>08</expirationMonth>
          <expirationYear>2019</expirationYear>
          <cvNumber>123</cvNumber>
          <cardType>001</cardType>
        </card>
        <subscription>
          <paymentMethod>credit card</paymentMethod>
        </subscription>
        <recurringSubscriptionInfo>
          <amount>0.00</amount>
          <frequency>on-demand</frequency>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionCreateService run="true"/>
        <businessRules>
          <ignoreAVSResult>true</ignoreAVSResult>
        </businessRules>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - a2_e0c38570-4c38-47ea-a4c9-d1bd8a891b5b
      Content-Type:
      - text/xml
      Content-Length:
      - '1496'
      Date:
      - Thu, 27 Apr 2017 20:48:02 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - _op_aixPageId=a2_e0c38570-4c38-47ea-a4c9-d1bd8a891b5b; Path=/
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-1467900847"><wsu:Created>2017-04-27T20:48:02.144Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.121"><c:merchantReferenceCode>17-1493326081</c:merchantReferenceCode><c:requestID>4933260817406473803010</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>Ahj/7wSTC26/L+UqEBUCESDZgwctWDNhBYxZkRizhJ/P4VAUMAp/P4VAUNpABvNhk0ky3SA7PE6BOTC26/L+UqEBUCAA+RiH</c:requestToken><c:purchaseTotals><c:currency>USD</c:currency></c:purchaseTotals><c:ccAuthReply><c:reasonCode>100</c:reasonCode><c:amount>0.00</c:amount><c:authorizationCode>888888</c:authorizationCode><c:avsCode>X</c:avsCode><c:avsCodeRaw>I1</c:avsCodeRaw><c:cvCode/><c:authorizedDateTime>2017-04-27T20:48:02Z</c:authorizedDateTime><c:processorResponse>100</c:processorResponse><c:reconciliationID>60095030A1ELD13B</c:reconciliationID></c:ccAuthReply><c:paySubscriptionCreateReply><c:reasonCode>100</c:reasonCode><c:subscriptionID>4933260817406473803010</c:subscriptionID></c:paySubscriptionCreateReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Thu, 27 Apr 2017 20:48:02 GMT
- request:
    method: post
    uri: https://ics2wstesta.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.121">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>17-1493326082</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.65.0</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin16</clientEnvironment>
        <recurringSubscriptionInfo>
          <subscriptionID>4933260817406473803010</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionRetrieveService run="true"/>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - a2_81f2411e-22b4-4a98-8729-41ce4f3cf41c
      Content-Type:
      - text/xml
      Content-Length:
      - '1866'
      Date:
      - Thu, 27 Apr 2017 20:48:02 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - _op_aixPageId=a2_81f2411e-22b4-4a98-8729-41ce4f3cf41c; Path=/
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-836211729"><wsu:Created>2017-04-27T20:48:02.715Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.121"><c:merchantReferenceCode>17-1493326082</c:merchantReferenceCode><c:requestID>4933260826596146703007</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhjzbwSTC26/OEDNQGqfEQFP6N8ThstIAN5sMmkmW6QHZ4nAGgAA6w4h</c:requestToken><c:paySubscriptionRetrieveReply><c:reasonCode>100</c:reasonCode><c:approvalRequired>false</c:approvalRequired><c:automaticRenew>false</c:automaticRenew><c:cardAccountNumber>411111XXXXXX1111</c:cardAccountNumber><c:cardExpirationMonth>08</c:cardExpirationMonth><c:cardExpirationYear>2019</c:cardExpirationYear><c:cardType>001</c:cardType><c:city>Eugene</c:city><c:country>US</c:country><c:currency>USD</c:currency><c:email>user32@hellobar.com</c:email><c:endDate>99991231</c:endDate><c:firstName>TOBIAS</c:firstName><c:frequency>on-demand</c:frequency><c:lastName>LUETKE</c:lastName><c:paymentMethod>credit card</c:paymentMethod><c:paymentsRemaining>0</c:paymentsRemaining><c:postalCode>97408</c:postalCode><c:startDate>20170428</c:startDate><c:state>OR</c:state><c:status>CURRENT</c:status><c:street1>123 Some St</c:street1><c:subscriptionID>4933260817406473803010</c:subscriptionID><c:totalPayments>0</c:totalPayments><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionRetrieveReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Thu, 27 Apr 2017 20:48:02 GMT
- request:
    method: post
    uri: https://ics2wstesta.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.121">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>17-1493326082</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.65.0</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin16</clientEnvironment>
        <billTo>
          <firstName>Tobias</firstName>
          <lastName>Luetke</lastName>
          <street1>123 Some St</street1>
          <city>Eugene</city>
          <state>OR</state>
          <postalCode>97408</postalCode>
          <country>US</country>
          <email>user32@hellobar.com</email>
        </billTo>
        <card>
          <accountNumber>4111111111111111</accountNumber>
          <expirationMonth>08</expirationMonth>
          <expirationYear>2019</expirationYear>
          <cvNumber>123</cvNumber>
          <cardType>001</cardType>
        </card>
        <subscription>
          <paymentMethod>credit card</paymentMethod>
        </subscription>
        <recurringSubscriptionInfo>
          <subscriptionID>4933260817406473803010</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionUpdateService run="true"/>
        <businessRules>
          <ignoreAVSResult>true</ignoreAVSResult>
        </businessRules>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - a2_4a4460ad-b024-493d-98a5-97647ddc6121
      Content-Type:
      - text/xml
      Content-Length:
      - '1063'
      Date:
      - Thu, 27 Apr 2017 20:48:03 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - _op_aixPageId=a2_4a4460ad-b024-493d-98a5-97647ddc6121; Path=/
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-1712858109"><wsu:Created>2017-04-27T20:48:03.327Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.121"><c:merchantReferenceCode>17-1493326082</c:merchantReferenceCode><c:requestID>4933260832296695303009</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhizbwSTC26/PXAQbQthEQFP6c2AcqADebDJpJlukB2eJwCYcSha</c:requestToken><c:paySubscriptionUpdateReply><c:reasonCode>100</c:reasonCode><c:subscriptionID>4933260817406473803010</c:subscriptionID><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionUpdateReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Thu, 27 Apr 2017 20:48:03 GMT
- request:
    method: post
    uri: https://ics2wstesta.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.121">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>17-1493326083</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.65.0</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin16</clientEnvironment>
        <recurringSubscriptionInfo>
          <subscriptionID>4933260817406473803010</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionRetrieveService run="true"/>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - a2_7bbe2ffe-e8dc-4c75-b03b-d4e7fe4b4d6d
      Content-Type:
      - text/xml
      Content-Length:
      - '1866'
      Date:
      - Thu, 27 Apr 2017 20:48:04 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - _op_aixPageId=a2_7bbe2ffe-e8dc-4c75-b03b-d4e7fe4b4d6d; Path=/
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-975580288"><wsu:Created>2017-04-27T20:48:04.220Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.121"><c:merchantReferenceCode>17-1493326083</c:merchantReferenceCode><c:requestID>4933260841246308403012</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhjzbwSTC26/RZPO74dEEQFP6N8Ths9IAN5sMmkmW6QHZ4nAGgAA6g4i</c:requestToken><c:paySubscriptionRetrieveReply><c:reasonCode>100</c:reasonCode><c:approvalRequired>false</c:approvalRequired><c:automaticRenew>false</c:automaticRenew><c:cardAccountNumber>411111XXXXXX1111</c:cardAccountNumber><c:cardExpirationMonth>08</c:cardExpirationMonth><c:cardExpirationYear>2019</c:cardExpirationYear><c:cardType>001</c:cardType><c:city>Eugene</c:city><c:country>US</c:country><c:currency>USD</c:currency><c:email>user32@hellobar.com</c:email><c:endDate>99991231</c:endDate><c:firstName>TOBIAS</c:firstName><c:frequency>on-demand</c:frequency><c:lastName>LUETKE</c:lastName><c:paymentMethod>credit card</c:paymentMethod><c:paymentsRemaining>0</c:paymentsRemaining><c:postalCode>97408</c:postalCode><c:startDate>20170428</c:startDate><c:state>OR</c:state><c:status>CURRENT</c:status><c:street1>123 Some St</c:street1><c:subscriptionID>4933260817406473803010</c:subscriptionID><c:totalPayments>0</c:totalPayments><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionRetrieveReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Thu, 27 Apr 2017 20:48:04 GMT
- request:
    method: post
    uri: https://ics2wstesta.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.121">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>17-1493326084</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.65.0</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin16</clientEnvironment>
        <recurringSubscriptionInfo>
          <subscriptionID>4933260817406473803010</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionRetrieveService run="true"/>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - a2_a662a5eb-9a7a-4677-a82a-8ba41579a56d
      Content-Type:
      - text/xml
      Content-Length:
      - '1867'
      Date:
      - Thu, 27 Apr 2017 20:48:05 GMT
      Connection:
      - keep-alive
      Set-Cookie:
      - _op_aixPageId=a2_a662a5eb-9a7a-4677-a82a-8ba41579a56d; Path=/
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-1520384019"><wsu:Created>2017-04-27T20:48:05.009Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.121"><c:merchantReferenceCode>17-1493326084</c:merchantReferenceCode><c:requestID>4933260849166695403009</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhjzbwSTC26/TMfqyg4BEQFP7JjDAX9IAN5sMmkmW6QHZ4nAGgAA+g57</c:requestToken><c:paySubscriptionRetrieveReply><c:reasonCode>100</c:reasonCode><c:approvalRequired>false</c:approvalRequired><c:automaticRenew>false</c:automaticRenew><c:cardAccountNumber>411111XXXXXX1111</c:cardAccountNumber><c:cardExpirationMonth>08</c:cardExpirationMonth><c:cardExpirationYear>2019</c:cardExpirationYear><c:cardType>001</c:cardType><c:city>Eugene</c:city><c:country>US</c:country><c:currency>USD</c:currency><c:email>user32@hellobar.com</c:email><c:endDate>99991231</c:endDate><c:firstName>TOBIAS</c:firstName><c:frequency>on-demand</c:frequency><c:lastName>LUETKE</c:lastName><c:paymentMethod>credit card</c:paymentMethod><c:paymentsRemaining>0</c:paymentsRemaining><c:postalCode>97408</c:postalCode><c:startDate>20170428</c:startDate><c:state>OR</c:state><c:status>CURRENT</c:status><c:street1>123 Some St</c:street1><c:subscriptionID>4933260817406473803010</c:subscriptionID><c:totalPayments>0</c:totalPayments><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionRetrieveReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version: 
  recorded_at: Thu, 27 Apr 2017 20:48:05 GMT
recorded_with: VCR 3.0.3
